# Задача 6: Вы пользуетесь общественным транспортом?
# Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no

n = input("Введите шестизначный номер билета: ")
sum1 = 0
sum2 = 0

for i in range(3):
    sum1 += int(n[i])
    sum2 += int(n[i+3])

if sum1 == sum2:
    print(f"{n} -> yes")
else:
    print(f"{n} -> no")
