# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами. 
# За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов. 
# Выведите наименьшее число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

n = int(input("Класс1: "))
m = int(input("Класс2: "))
k = int(input("Класс3: "))
print(f"Нужно {(n+1)//2+(m+1)//2+(k+1)//2} парт")
print(f"Нужно {n//2+m//2+k//2+n%2+m%2+k%2} парт")