# Задача №33. Хакер Василий получил доступ к классному журналу и хочет заменить все свои минимальные оценки на
# максимальные. Напишите программу, которая заменяет оценки Василия, но наоборот: все максимальные – на минимальные.
# Input: 5 -> 1 3 3 3 4
# Output: 1 3 3 3 1

list_1 = [1, 3, 3, 3, 4,6,3,5,2]
min=list_1[0]
max = list_1[0]

for i in list_1:
    if i<min:
        min=i
    if i>max:
        max=i

for i in range(len(list_1)):
    if list_1[i]==max:
        list_1[i]=min

print(list_1)