# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# 5 [1 2 3 4 5] 3 -> 1

n = int(input("Введите количество элементов: "))
list_1 = []

for i in range(n):
    list_1.append(int(input(f"Введите {i+1} элемент: ")))

print(list_1)
x = int(input("Введите искомый элемент: "))

count = 0

for i in range(n):
    if list_1[i] == x:
        count += 1

print(f"{n}  {list_1}  {x} -> {count}")
