# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# 5 [1 2 3 4 5] 6 -> 5


n = int(input("Введите количество элементов: "))
list_1 = []

for i in range(n):
    list_1.append(int(input(f"Введите {i+1} элемент: ")))

print(list_1)


if (len(list_1) == 0):
    print("Пустой массив")
else:
    x = int(input("Введите заданный элемент: "))
    min = abs(x-list_1[0])
    minNum = list_1[0]
    for i in range(n):
        if abs(x-list_1[i]) < min:
            min = abs(x-list_1[i])
            minNum = list_1[i]

    print(f"{n}  {list_1}  {x} -> {minNum}")
