# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.
import math

s = int(input("Введите сумму чисел: "))
p = int(input("Введите произведение чисел: "))

# x+y=s
# x*y=p
# y=s-x
# x*(s-x)=p
# x^2-s*x+p=0
D = s**2-4*p
if (D < 0):
    print("Данные введены неверно")
else:
    x1 = (s - math.sqrt(D))/2
    if x1-int(x1) != 0:
        print("Данные введены неверно")
    else:
        x1 = int(x1)
        y1 = s-x1
        print(f"сумма = {s}, произведение = {p} -> {x1}, {y1}")
