# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

n = int(input("Введите число N: "))

x = 1
i = 0

while x < n:
    print(2**i)
    i += 1
    x = 2**i
