# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.


n = int(input("Введите размер N: "))
nList = []

for i in range(n):
    nList.append(int(input(f"Введите {i+1} элемент: ")))

m = int(input("Введите размер M: "))
mList = []

for i in range(m):
    mList.append(int(input(f"Введите {i+1} элемент: ")))

print(nList)
print(mList)
print(set(nList).intersection(set(mList)))
