# 15. Иван Васильевич пришел на рынок и решил купить два арбуза: один для себя, а другой для тещи. Понятно, что для себя нужно выбрать арбуз потяжелей, а для тещи полегче. Но вот незадача: арбузов слишком много и он не знает как же выбрать самый легкий и самый тяжелый арбуз? Помогите ему!
# Пользователь вводит одно число N – количество арбузов. Вторая строка содержит N чисел, записанных на новой строчке каждое. Здесь каждое число – это масса соответствующего арбуза
# Input:	5 -> 5 1 6 5 9
# Output:	1 9

n = int(input("Введите количество арбузов: "))
min = int(input("арбуз 1: "))
max = min

for i in range(n-1):
    wat = int(input(f"арбуз {i+2}: "))
    if wat > max:
        max = wat
    elif wat < min:
        min-wat

print(f"min={min} max={max}")
