# Задача №11.
# Дано натуральное число A > 1. Определите, каким по счету числом Фибоначчи оно является, то есть выведите такое число n, что φ(n)=A.
# Если А не является числом Фибоначчи, выведите число -1.
# Input: 5
# Output: 6


n = int(input("Введите число: "))
i = 1
a = 0
b = 1

while n > a:
    a, b = b, a+b
    i += 1

if (a == n):
    print(f"Номер {i}")
else:
    print(f"Номер -1")
